app/controllers/users_controller.rb

	def show
		@user = User.find params[:id]
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @user = User.find(params[:id])
    if(!@user.nil?)
      if(@user.update_attributes(params[:user]))
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `salt` = '2011-04-08 08:32:45 UTC123456', `encrypted_password` = '2011-04-08 08:32:45 UTC123456123456', `updated_at` = '2011-04-08 08:32:45' WHERE `users`.`id` = 1

  def create
    @placeable = find_placeable

    @user = @placeable.users.build(params[:user])
    @user.role = @placeable.class.to_s

    if @user.save
---
INSERT INTO `users` (`user_name`, `password`, `phone_number`, `role`, `created_at`, `updated_at`, `place_id`, `place_type`, `salt`, `remember_token`, `encrypted_password`, `email`) VALUES ('admin', '123456', '0975553553', 'Village', '2011-04-08 08:28:35', '2011-04-08 08:28:35', 1, 'Village', '2011-04-08 08:28:35 UTC123456', NULL, '2011-04-08 08:28:35 UTC123456123456', 'admin@yahoo.com')

  def data_entry
    pro_takao =  Province.new(:name=>"Takao", :name_kh=>"Takao",:code => "98888881")
    pro_takao.save

    district_takao1 = District.new(:name=>"Laem1", :name_kh=>"Laem_kh1",:code => "88888881",:province_id =>pro_takao.id)
    district_takao1.save

    district_takao2 = District.new(:name=>"Laem2", :name_kh=>"Laem_kh2",:code => "88888882",:province_id =>pro_takao.id)
    district_takao2.save


    hc_takao1 = HealthCenter.new(:name=>"Hc1", :name_kh=>"Hc1_kh1",:code => "78888881",:district_id =>district_takao1.id)
    hc_takao1.save


    village1 = Village.new(:name=>"Vl1",
          :name_kh=>"Vl1",:code => "68888881",
          :district_id =>district_takao1.id,
          :health_center_id => hc_takao1.id )
    village1.save

    village2 = Village.new(:name=>"Vl2",
          :name_kh=>"Vl2",:code => "68888882",
          :district_id =>district_takao1.id,
          :health_center_id => hc_takao1.id )
    village2.save

    user_province = User.new :phone_number =>"85517808707",
                             :place_id =>pro_takao.id,
                             :place_type=>"Province"
    user_province.save
---
INSERT INTO `provinces` (`name`, `name_kh`, `code`, `created_at`, `updated_at`) VALUES ('Takao', 'Takao', '98888881', '2011-04-08 08:46:42', '2011-04-08 08:46:42')
INSERT INTO `districts` (`name`, `name_kh`, `code`, `created_at`, `updated_at`, `province_id`) VALUES ('Laem1', 'Laem_kh1', '88888881', '2011-04-08 08:46:42', '2011-04-08 08:46:42', 21)
INSERT INTO `health_centers` (`name`, `name_kh`, `code`, `created_at`, `updated_at`, `district_id`) VALUES ('Hc1', 'Hc1_kh1', '78888881', '2011-04-08 08:48:48', '2011-04-08 08:48:48', 156)
INSERT INTO `villages` (`name`, `name_kh`, `code`, `created_at`, `updated_at`, `district_id`, `health_center_id`) VALUES ('Vl1', 'Vl1', '68888881', '2011-04-08 08:49:20', '2011-04-08 08:49:20', 158, 730)
INSERT INTO `users` (`user_name`, `password`, `phone_number`, `role`, `created_at`, `updated_at`, `place_id`, `place_type`, `salt`, `remember_token`, `encrypted_password`, `email`) VALUES (NULL, NULL, '85517808707', NULL, '2011-04-08 11:17:00', '2011-04-08 11:17:00', 1, 'Province', NULL, NULL, NULL, NULL)